Tekla.Structures.Internal.RemotingProxyFactory
Factory used to instantiate remote proxies correctly in default application domain.

Tekla.Structures.Internal.RemotingProxyFactory.CreateRemotingProxy(System.String,System.String)
Instantiates given remoting proxy type from given assembly.
assemblyName: Assembly from which proxy should be loaded
typeName: Proxy type name
Returns: Proxy object